In [1]:
import pandas as pd
import numpy as np
from sklearn.tree import DecisionTreeClassifier

In [110]:
data = pd.read_csv ('titanic.csv')

In [111]:
data.shape

(891, 12)

In [112]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [113]:
data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [114]:
data_new = data[["Survived", "Pclass", "Sex", "Age","Fare"]]

In [118]:
data_new.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
dtype: int64

In [119]:
data_na_free = data_new.dropna()

In [120]:
data_na_free.isna().sum()

Survived    0
Pclass      0
Sex         0
Age         0
Fare        0
dtype: int64

In [121]:
X = data_na_free[["Pclass",  "Fare", "Age", "Sex"]]

In [122]:
X = pd.get_dummies(X)

In [94]:
X.head()

   Pclass     Fare   Age  Sex_female  Sex_male
0       3   7.2500  22.0           0         1
1       1  71.2833  38.0           1         0
2       3   7.9250  26.0           1         0
3       1  53.1000  35.0           1         0
4       3   8.0500  35.0           0         1

In [123]:
X = X.drop("Sex_female", axis = 1)

In [124]:
X.head()

   Pclass     Fare   Age  Sex_male
0       3   7.2500  22.0         1
1       1  71.2833  38.0         0
2       3   7.9250  26.0         0
3       1  53.1000  35.0         0
4       3   8.0500  35.0         1

In [126]:
X.shape

(714, 4)

In [127]:
y = data_na_free[["Survived"]]

In [128]:
y.head()

   Survived
0         0
1         1
2         1
3         1
4         0

In [129]:
y.isna().sum()

Survived    0
dtype: int64

In [130]:
y.shape

(714, 1)

In [131]:
clf = DecisionTreeClassifier(random_state=241)

In [132]:
clf

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=241, splitter='best')

In [133]:
clf.fit(X, y)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=241, splitter='best')

In [134]:
feature_importances_df = pd.DataFrame({'features':list(X),
                                      "feature_importances":clf.feature_importances_})

In [135]:
feature_importances_df.sort_values('feature_importances', ascending = False)

   features  feature_importances
1      Fare             0.303436
3  Sex_male             0.300512
2       Age             0.256046
0    Pclass             0.140005

In [85]:
clf.feature_importances_

array([0.01793336, 0.29549222, 0.40310552, 0.2834689 ])